content/post/spacemacs-spell-checking-configuration-in-windows/.spacemacs-spell-checking-configuration-in-windows.org
#+STARTUP: content
#+OPTIONS: \n:t
#+EXPORT_FILE_NAME:	 index

#+TITLE:	Spacemacs - Spell Checking Configuration in Windows
#+AUTHOR:	Shawn Dennis Lin
#+EMAIL:	ShawnDennisLin@gmail.com
#+DATE:	[2022-05-09 Mon]
#+HUGO_AUTO_SET_LASTMOD: t

#+hugo_custom_front_matter: :description
#+hugo_custom_front_matter: :math false
#+hugo_custom_front_matter: :slug spacemacs-spell-checking-in-windows
#+hugo_custom_front_matter: :image image.jpeg

#+HUGO_CATEGORIES: Editor
#+HUGO_TAGS: emacs spell-checking

This post will introduce how to install *Spell Checking* on [[https://develop.spacemacs.org/][spacemacs]] in windows.

I will use [[https://github.com/hunspell/hunspell][hunspell]] instead to [[https://www-sop.inria.fr/members/Manuel.Serrano/flyspell/flyspell.html][flyspell]] on windows.

* Install Step
1. In spacemacs init.el add ~spell-checking~ layer.
2. Download the [[https://sourceforge.net/projects/ezwinports/files/?source=navbar][hunspell win32 binairy here]], look for hunspell-1.3.2-3-w32-bin.zip (ex: ctrl+F hunspell)
3. Unzip it, and copy to location (ex: *d:\application\hunspell-1.3.2-3-w32-bin\bin\hunspell.exe*)
4. Add this to your init.el file *dotspacemacs/user-config block*:
  #+begin_src lisp
  (setq-default ispell-program-name "d:/application/hunspell-1.3.2-3-w32-bin/bin/hunspell.exe")
  #+end_src
  note that the *\* have change into */*.

* Ref
1. [[https://emacs.stackexchange.com/a/57842][aspell with emacs 26.1 on ms windows]] 
